; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v2 - type_3 ?v4 - type_2)
 	      (pred_3 ?v3 - object ?v4 - type_2)
	      (pred_1 ?v2 - type_3 ?v1 - type_1)
	      (pred_2 ?v2 - type_3 ?v3 - object ?v1 - type_1))

   (:action op_3
       :parameters  (?v2 - type_3 ?v6 ?v5 - type_2)
       :precondition (and  (pred_4 ?v2 ?v6))
       :effect (and  (pred_4 ?v2 ?v5)
		     (not (pred_4 ?v2 ?v6))))

   (:action op_2
       :parameters (?v2 - type_3 ?v8 - object ?v7 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_3 ?v8 ?v7) (pred_4 ?v2 ?v7) (pred_1 ?v2 ?v1))
       :effect (and (pred_2 ?v2 ?v8 ?v1)
		    (not (pred_3 ?v8 ?v7)) 
		    (not (pred_1 ?v2 ?v1))))

   (:action op_1
       :parameters (?v2 - type_3 ?v8 - object ?v7 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_2 ?v2 ?v8 ?v1) (pred_4 ?v2 ?v7))
       :effect (and (pred_3 ?v8 ?v7)
		    (pred_1 ?v2 ?v1)
		    (not (pred_2 ?v2 ?v8 ?v1)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_08 - type_3
obj_09 obj_10 - type_1
obj_05 obj_06 obj_01 obj_04 - type_2
obj_03 obj_02 obj_07 - object)
(:init
(pred_4 obj_08 obj_01)
(pred_1 obj_08 obj_09)
(pred_1 obj_08 obj_10)
(pred_3 obj_03 obj_05)
(pred_3 obj_02 obj_06)
(pred_3 obj_07 obj_01)
)
(:goal
(and
(pred_3 obj_03 obj_04)
(pred_3 obj_02 obj_01)
(pred_3 obj_07 obj_05)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_08 ?b obj_10))))
)
)

; plan
1. (op_2 obj_08 obj_07 obj_01 obj_09)
   deleted: (pred_3 obj_07 obj_01) (pred_1 obj_08 obj_09)
   added: (pred_2 obj_08 obj_07 obj_09)
   goals met: 0 of 3
2. (op_3 obj_08 obj_01 obj_05)
   deleted: (pred_4 obj_08 obj_01)
   added: (pred_4 obj_08 obj_05)
   goals met: 0 of 3
3. (op_1 obj_08 obj_07 obj_05 obj_09)
   deleted: (pred_2 obj_08 obj_07 obj_09)
   added: (pred_3 obj_07 obj_05) (pred_1 obj_08 obj_09)
   goals met: 1 of 3
4. (op_2 obj_08 obj_03 obj_05 obj_09)
   deleted: (pred_3 obj_03 obj_05) (pred_1 obj_08 obj_09)
   added: (pred_2 obj_08 obj_03 obj_09)
   goals met: 1 of 3
5. (op_3 obj_08 obj_05 obj_04)
   deleted: (pred_4 obj_08 obj_05)
   added: (pred_4 obj_08 obj_04)
   goals met: 1 of 3
6. (op_1 obj_08 obj_03 obj_04 obj_09)
   deleted: (pred_2 obj_08 obj_03 obj_09)
   added: (pred_3 obj_03 obj_04) (pred_1 obj_08 obj_09)
   goals met: 2 of 3
7. (op_3 obj_08 obj_04 obj_06)
   deleted: (pred_4 obj_08 obj_04)
   added: (pred_4 obj_08 obj_06)
   goals met: 2 of 3
8. (op_2 obj_08 obj_02 obj_06 obj_09)
   deleted: (pred_3 obj_02 obj_06) (pred_1 obj_08 obj_09)
   added: (pred_2 obj_08 obj_02 obj_09)
   goals met: 2 of 3
9. (op_3 obj_08 obj_06 obj_01)
   deleted: (pred_4 obj_08 obj_06)
   added: (pred_4 obj_08 obj_01)
   goals met: 2 of 3
10. (op_1 obj_08 obj_02 obj_01 obj_09)
   deleted: (pred_2 obj_08 obj_02 obj_09)
   added: (pred_3 obj_02 obj_01) (pred_1 obj_08 obj_09)
   goals met: 3 of 3
